{
  "PAGE_TITLE": "Adam Kui | Dev",
  "LINK_MENU_GITHUB": "GitHub",
  "LINK_MENU_LINKEDIN": "LinkedIn",
  "LINK_MENU_CODERSRANK": "CodersRank",
  "WELCOME_TEXT_1": "Welcome.",
  "WELCOME_TEXT_2": "My name is Adam Kui.",
  "WELCOME_TEXT_3": "I'm a software developer from Budapest, Hungary.",
  "WELCOME_TEXT_4": "Take a look around!",
  "CAREER_TITLE": "Career 🏢",
  "CAREER_BODY": "My journey started when I joined General Electric in 2017, as a Robotic 🤖 Process Automation Developer (RPA) Intern.  I met, and also did programming before, but even though doing RPA is not a tipical 'write code in an IDE' job, I fell in love with learning programming. 👨‍💻 I started to become more and more motived, and in a few years I got to a senior 👴 level in RPA. However, I felt like I had much more in me, and I really wanted to learn something new. So in 2020 I started to look for new opportunities, when I came accross frontend development. I quickly fell in love 😍 with it. I've spent more than a year coding 8-12 hours after work during the nigth, working on hobby projects while I was studying from online courses. First just HTML + CSS, then JavaScript, and then only frameworks and a bunch of libraries. Today I mostly enjoy working on React / Next.js projects (like this website). For the future I definitely want to learn more about SSR, other frontend frameworks (Angular and Vue), and who knows what else the future will bring! 🤓",
  "FOOTER_COPYRIGHT": "Copyright © 2022 Adam Kui. All Rights Reserved.",
  "LOGO": "Adam Kui",
  "NAVIGATION_LINKS_TITLE": "Links",
  "PROFILE_NAME": "Adam Kui",
  "PROFILE_JOB": "Frontend Software Developer",
  "PROFILE_CODE_EDITOR": "import { FC, useEffect } from 'react'; \n\n const HelloWorld: FC = () => {\n\tuseEffect(()=> {\n\t\tconsole.log('Hello World!')\n\t}, []);\n\n\t// Don't judge by what you see! ~ FrontendDev Coelho \n\treturn null;\n};",
  "TECH_STACK_TITLE": "Tech Stack 👨‍💻",
  "TECH_STACK_BODY": "I know... this is the reoccuring topic that probalby almost all developers and recruiters are mostly interested in. 🔎 So I decided to collect the most important applications, programming languages, frameworks, libraries, package managers, etc., to show a little bit more of my background. If it got your attention, you can also take a look at my portfolio, or even better: go to my GitHub page, and see all my public repositories. Hope you'll enjoy! 😎",
  "TECH_STACK_PORTFOLIO_BUTTON_LABEL": "View My Portfolio",
  "TECH_STACK_MORE": "... and many more 🤯",
  "ABOUT_ME_TITLE": "What I ❤️",
  "ABOUT_ME_BODY_1": "I feel very lucky, because my job is also my passion. I sit quite a lot in front of my desk, so I also became passionate about my desk setup. I was watching quite a lot of videos on YouTube, and tried so many variations and items on my desk, but I'm very satisfied with the results now.",
  "ABOUT_ME_BODY_2": "In my free time I often like to go fishing / street workout / running / planespotting / cooking.",
  "ABOUT_ME_BODY_3": "Here is my current desk setup:"
}
