{
  "BACK": "Back",
  "GOT_IT": "Got it",
  "READ_ARTICLE": "Read full article",
  "DARK_MODE_TOOLTIP": "Light / Dark mode",
  "PAGE_TITLE": "Adam Kui | Developer",
  "LINK_MENU_GITHUB": "GitHub",
  "LINK_MENU_NPMJS": "NpmJs",
  "LINK_MENU_LINKEDIN": "LinkedIn",
  "LINK_MENU_CODERSRANK": "CodersRank",
  "SCROLL_TO_TOP": "Scroll to top",
  "WELCOME_TEXT_1": "Welcome.",
  "WELCOME_TEXT_2": "My name is Adam Kui.",
  "WELCOME_TEXT_3": "I'm a software developer from Budapest, Hungary.",
  "WELCOME_TEXT_4": "Take a look around!",
  "PROFILE_LOCATION": "Budapest, Hungary",
  "PROFILE_EMAIL": "addam.kui@gmail.com",
  "PROFILE_CV_DOWNLOAD": "Download my CV",
  "PROFILE_CV_DOWNLOAD_TOASTIFY": "Your download has started",
  "CAREER_TITLE": "Career 🏢",
  "CAREER_BODY": "My professional programming journey started when I joined General Electric in 2017, as a Robotic Process Automation Developer (RPA) intern. 🤖 I met, and also did programming before, but even though RPA is not the typical write lines of code technology, I fell in love with learning programming. 👨‍💻 I quickly realised that being a programmer is something I absolutely love, and what I can do passionately. I started to become more and more motived, and in a few years I became a senior level RPA developer. 👴 However, I felt like I had much more in me, and I really wanted to learn something new. So, in 2020 I started to look for new opportunities, when I came across frontend development. I just fell in love with it. 😍 I've spent about 1.5 years coding 8-12 hours after work, during the nigth, 5-6 times a week, working on hobby projects while I was studying from online courses. First just HTML and CSS, then JavaScript, and then TypeScript, frameworks, and a bunch of libraries. As a result, I got my first job as a Medior Frontend Developer in 2021. Nowadays I mostly enjoy working on React and Next.js projects, and in the future I definitely want to learn other frontend frameworks (Angular and Vue), mobile development, and who knows what else the future will bring! 🤓",
  "FOOTER_COPYRIGHT": "Copyright © 2022 Adam Kui. All Rights Reserved.",
  "LOGO": "Adam Kui",
  "NAVIGATION_LINKS_TITLE": "Links",
  "PROFILE_NAME": "Adam Kui",
  "PROFILE_JOB": "Frontend Software Developer",
  "PROFILE_CODE_EDITOR": "import { FC } from 'react'; \n\nconst HelloWorld: FC = () => {\n\tconsole.log('Hello World!');\n\n\t// Do you know how to make a 🍌 with JavaScript?\n\tconst baNaNa = 'b' + 'a' + + 'a' + 'a'\n\t// Enjoy it! 😎\n\treturn baNaNa;\n};",
  "TECH_STACK_TITLE": "Tech Stack 👨‍💻",
  "TECH_STACK_BODY": "This is the topic that probably all developers and recruiters are very much interested in. 🔎 So, I've decided to collect the most important applications, programming languages, frameworks, libraries and technologies I use, to show a little bit more of my background. If it got your attention, you can also take a look at my portfolio, or even better: go to my GitHub page, and see all my public repositories. Hope you'll enjoy! 😎",
  "TECH_STACK_PORTFOLIO_BUTTON_LABEL": "View By Categories",
  "TECH_STACK_MORE": "... check my portfolio for more! 🤯",
  "TECH_STACK_DIALOG_TITLE": "Tech Stack",
  "TECH_STACK_PACKAGE_MANAGER": "Package manager",
  "TECH_STACK_VERSION_CONTROL_SYSTEM": "Version Control",
  "TECH_STACK_HOSTING": "Hosting",
  "TECH_STACK_PROGRAMMING_LANGUAGE": "Programming language",
  "TECH_STACK_RUNTIME_ENVIRONMENT": "Runtime environment",
  "TECH_STACK_MARKUP_LANGUAGE": "Markup language",
  "TECH_STACK_MOBILE_DEVELOPMENT": "Mobile Development",
  "TECH_STACK_STYLE_SHEET_LANGUAGE": "Style Sheet Language",
  "TECH_STACK_BACKEND_FRAMEWORK": "Backend Framework",
  "TECH_STACK_BACKEND_LIBRARY": "Backend Library",
  "TECH_STACK_FRONTEND_FRAMEWORK": "Frontend Framework",
  "TECH_STACK_FRONTEND_LIBRARY": "Frontend Library",
  "TECH_STACK_CSS_FRAMEWORK": "CSS Framework",
  "TECH_STACK_CSS_PREPROCESSOR": "CSS Preprocessor",
  "TECH_STACK_UI_KIT": "UI Kit",
  "TECH_STACK_DATABASE": "Database Related",
  "TECH_STACK_SOFTWARE": "Software",
  "TECH_STACK_CMS": "CMS",
  "ABOUT_ME_TITLE": "What I ❤️",
  "ABOUT_ME_BODY_1": "I feel very lucky, because I love my job. As a result, I sit a lot in front of my desk, so I think it is very important to have the proper setup for work. I became passionate about my desk setup, as I was watching quite a lot of related videos on YouTube, browse Instagram for ideas, and tried so many variations and items on my desk. I'm very satisfied with the current setup on my desk, you can see a picture about it below.",
  "ABOUT_ME_BODY_2": "In my free time I often like to go fishing to the nearby rivers, do street workout, go for a run, spend time with my friends, go for planespotting and even cooking. I also play the bass guitar, a few years ago I even had my own funky band. On the weekends I love to watch Formula 1 races, as I'm a big fan of it for more than 10 years now.",
  "CREATED_WITH_TITLE": "Created with 🛠",
  "CREATED_WITH_BODY": "🏗 This website was built using Next.js, React, TypeScript, MaterialUI, HeadlessUI, Tailwind CSS and Cloudinary.",
  "CREATED_WITH_BODY_2": "Check out the source code",
  "CREATED_WITH_BODY_3": "🎥 Special thanks for the amazing videos to:",
  "PORTFOLIO_TITLE_PROFESSIONAL": "Professional 👔",
  "PORTFOLIO_TITLE_HOBBY_PROJECTS": "Other 🧐",
  "PORTFOLIO_TITLE_LIST_VIEW": "Archive 📂",
  "PORTFOLIO_VISIT_WEBSITE": "Visit Website",
  "PORTFOLIO_VISIT_GITHUB": "Visit GitHub",
  "PORTFOLIO_VISIT_NPMJS": "Visit Npm",
  "PORTFOLIO_MORE_INFORMATION": "More Information",
  "PORTFOLIO_GEORGE_STORE_TITLE": "George Store (FE)",
  "PORTFOLIO_GEORGE_STORE_DESCRIPTION": "George Store is an online sales platform integrated in Erste Bank's popular netbanking application, George. The app is available both on the web and as part of the native mobile app for iOS and Android. I'm responsible for feature preparation, development, unit testing, technical tasks and bug fixes. This application is used by over 600.000 people in Hungary.",
  "PORTFOLIO_GEORGE_ADMIN_TITLE": "George Admin (FE)",
  "PORTFOLIO_GEORGE_ADMIN_DESCRIPTION": "George Admin is an internal web application designed for desktop only. Its features contains two different messengers, query and administration pages for different purposes. I'm responsible for the same tasks as in George Store's.",
  "PORTFOLIO_GEORGE_MICROSITES_TITLE": "George Microsites (FE)",
  "PORTFOLIO_GEORGE_MICROSITES_DESCRIPTION": "A set of microsites, cloned from George Store, for the purpose of UX research.",
  "PORTFOLIO_GEORGE_MOCK_BACKEND_TITLE": "FE Development Related Mock Apps (BE)",
  "PORTFOLIO_GEORGE_MOCK_BACKEND_DESCRIPTION": "NodeJS and ExpressJS mock backend applications, for test environment independent frontend development.",
  "PORTFOLIO_REACT_BREAKPOINT_UTILS_TITLE": "react-breakpoint-utils (FE library)",
  "PORTFOLIO_REACT_BREAKPOINT_UTILS_DESCRIPTION": "Being my first ever self-made FE library, react-breakpoint-utils is a TypeScript utility library, made for React. It is aiming to help with declaring, and using breakpoints easily for responsive UI development in React. You can easily try it, by running npm i react-breakpoint-utils. See the documentation with some examples on npmjs.com below.",
  "PORTFOLIO_PAL_GOLLNER_TITLE": "Pal Gollner Portfolio (Full Stack)",
  "PORTFOLIO_PAL_GOLLNER_DESCRIPTION": "Minimal design portfolio website of urban and sport photographer, Pal Gollner. Check out his content for some great photos!",
  "PORTFOLIO_EGRIAPARTMAN_TITLE": "Egriapartman.hu (FE)",
  "PORTFOLIO_EGRIAPARTMAN_DESCRIPTION": "Website of two apartments available for rent in Eger, Hungary. Built with React.",
  "PORTFOLIO_COVID_DASHBOARD_TITLE": "Covid Dashboard (FE)",
  "PORTFOLIO_COVID_DASHBOARD_DESCRIPTION": "A simple covid dashboard.",
  "PORTFOLIO_NOTES_APP_TITLE": "Notes App (FE)",
  "PORTFOLIO_NOTES_APP_DESCRIPTION": "A simple note taking application, using local storage to store notes. I created this app while learning React.",
  "PORTFOLIO_MUSIC_PLAYER_APP_TITLE": "Music Player App (FE)",
  "PORTFOLIO_MUSIC_PLAYER_APP_DESCRIPTION": "This is a nice music player app, one of my first projects created in React. You can listen to a set of songs, and have some common control buttons with different functionalities.",
  "PORTFOLIO_BEAT_MAKER_APP_TITLE": "Beat Maker App (FE)",
  "PORTFOLIO_BEAT_MAKER_APP_DESCRIPTION": "A beat maker app built with vanilla JavaScript. This idea of the project was to write object oriented JavaScript code.",
  "PORTFOLIO_COLORS_APP_TITLE": "Colors App (FE)",
  "PORTFOLIO_COLORS_APP_DESCRIPTION": "This app is a random color palette generator, with a library for saved palettes function. It is very similar to the popular application, Coolors.",
  "PORTFOLIO_PHOTO_SEARCH_APP_TITLE": "Photo Search App (FE)",
  "PORTFOLIO_PHOTO_SEARCH_APP_DESCRIPTION": "The idea behind this project was to learn more about async JavaScript. Using this app, you can search photos, by using Pexels API in the background.",
  "PORTFOLIO_DISCORD_CHATBOT_TITLE": "Discord News Fetch ChatBot (BE)",
  "PORTFOLIO_DISCORD_CHATBOT_DESCRIPTION": "This is a Discord.JS application that fetches data from Rockstar Newswire website on a regular base, formats the data in an embedded Discord message, and sends to the configured Discord channel(s). I was using this application with my friends on our gaming Discord server, to be updated about any news related to GTA 5 Online.",
  "PORTFOLIO_OLD_PORTFOLIO_TITLE": "My old portfolio website (FE)",
  "PORTFOLIO_OLD_PORTFOLIO_DESCRIPTION": "My first ever portfolio website, built without React. This page is not in use anymore.",
  "PORTFOLIO_MORE_ON_GITHUB": "... check my GitHub for more 📦",
  "BLOG_NO_POSTS": "Nothing to see here yet..."
}
